package Homework2_3;

public class WordArray {
    public String[] array() {
        String[] strings = new String[]{
                "консилиум",
                "приют",
                "принц",
                "аккомпанемент",
                "ртуть",
                "лицо",
                "строгий",
                "образование",
                "отступать",
                "японец",
                "ложить",
                "колун",
                "гнев",
                "исправлять",
                "компетентный",
                "негатив",
                "престол",
                "изменять",
                "струна",
                "струна",
                "струна",
                "струна",
                "высочество",
                "высочество",
                "высочество",
                "высочество",
                "высочество",
                "высочество",
                "высочество",
                "высочество"
        };
        return strings;
    }
}
